output/posts/on-we-are-on-a-break/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>On We Are on a Break | Bits of Experience</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://marcohassan.github.io/bits-of-experience/posts/on-we-are-on-a-break/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Marco Hassan">
<meta property="og:site_name" content="Bits of Experience">
<meta property="og:title" content="On We Are on a Break">
<meta property="og:url" content="https://marcohassan.github.io/bits-of-experience/posts/on-we-are-on-a-break/">
<meta property="og:description" content="Gosh. That kicked me. Out of a blue sky. There were issues but I
thought the relation was strong and that everything would be faced in
a mature way. Through discussion, through a fight, through a
comm">
<meta property="og:type" content="article">
<meta property="article:published_time" content="1970-02-22T10:34:14+01:00">
<meta property="article:tag" content="step down - step up">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../pages/aboutme/" title="About me"><i class="fa fa-user-circle"></i></a></li>
            <li><a href="../../pages/bits-of-experience-a-readable-view-on-my-study-adventures/" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../index.html" title="Blog"><i class="fa fa-edit"></i></a></li>
            <li><a href="../../pages/emacs/" title="A life Configuring Emacs"><i class="fa fa-code"></i></a></li>
            <li><a href="../../pages/papers/" title="Term and Research Papers"><i class="fa fa-university"></i></a></li>
            <li><a href="../../pages/foto-blog/" title="Foto Blog"><i class="fa fa-camera-retro"></i></a></li>
            <li><a href="https://github.com/MarcoHassan" title="My Github"><i class="fab fa-github"></i></a></li>
            <li><a href="https://stackoverflow.com/users/9731177/mhass" title="My Stack"><i class="fab fa-stack-overflow"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">On We Are on a Break</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="1970-02-22T10:34:14+01:00" itemprop="datePublished" title="1970-02-22 10:34">1970-02-22 10:34</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Marco Hassan
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> Tags:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/step-down-step-up/" rel="tag">step down - step up</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Gosh. That kicked me. Out of a blue sky. There were issues but I
thought the relation was strong and that everything would be faced in
a mature way. Through discussion, through a fight, through a
commitment. 
</p>

<!-- TEASER_END -->

<div id="outline-container-org6002084" class="outline-2">
<h2 id="org6002084">Day 1</h2>
<div class="outline-text-2" id="text-org6002084">
<p>
So story of my life, after 3 years and something of relationship, I
was told these magic 6 words by my girlfriend.
</p>

<p>
I was surprised. A lot surprised. We have a long distance
relationship. To be honest I do not believe in these break and reflect
stories. It means the story is already over.
</p>

<p>
She told me the 21/02/2021, by phone. Stressing her love. Saying it is
for the best. Saying goodbye amorino at the end. I refused that
sentence. Both at the phone and in myself. That is not how you
act. Really? On the phone.
</p>

<p>
The truth is also that I was pushing her to commit to put the
relationship over the individual work achievements. I will do that in
my life no matter what. So I was ready to do that as of now. She
probably thinks differently. She is very ambitious and that was
probably too much for her.
</p>

<p>
Some say I am a kid and it is not normal to commit to the other over
the job from such a young age. But really? If you don't do it now,
then when? When responsabilties will augment? I do not believe that
kind of narrative. If you follow a line you follow it from the
beginning. Plus we were just discussing on committing on a city. I am
sure that life is complex, and if you adapt, put good effort and you
are good, you will do well no matter what. So I really do not
understand when people act in an opportunistic way. They are probably
just scared and not confident enough in their capabilities. I do not
think that it is the case of her. She is not the type. There might be
some aspect of work relating to this though. Plus in any case I am
convinced that we both did work too much recently.
</p>

<p>
Well, now I do not know if that is what is in her head. In fact,
unfortunately I do not know at all what is in her head. She just told
me at the phone in 5 min. And me, I was too surprised to get this news
and in such a method. I could not start a conversation. A serious one
asking what was wrong. We had met the weekend before. If she wanted to
face things we could have done it then.
</p>

<p>
Anyways, she promised a letter. I guess that there, there will be more
motivations. I will then wait for this and see. In any case I really
think that our relationship is on the ground. I do not see it as a
true possibility to gain it back. Also trust. Yesterday night, in the
first night; I was so tempted to say screw you. It's over; I will not
wait here like a sentenced to death person. If there are issues let's
face them and solve them otherwise let's let each other go, no matter
how difficult that is.
</p>

<p>
I resisted. I controlled myself. I decided to wait until the
letter. Let's see what will come then.
</p>

<p>
In any case the emotion of this first day is the following: <b>anger</b>. I
am happy though that I could control it that far. Did not text her so
far. And committed to wait and give it a try. Let's see how it will
develop in the next couple of days.
</p>


<p>
<b>True Starting Date:</b> 22/02/2021
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav></nav></aside></article><footer id="footer"><p>Contents © 2021         <a href="mailto:marco.hassan30@gmail.com">Marco Hassan</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
